In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic = pd.read_excel('http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.xls')

In [4]:
titanic['first_name'] = titanic['name'].str.split(', ').str.get(1).str.split('.').str.get(1)
titanic['first_name']

0                             Elisabeth Walton
1                                Hudson Trevor
2                                Helen Loraine
3                      Hudson Joshua Creighton
4            Hudson J C (Bessie Waldo Daniels)
5                                        Harry
6                           Kornelia Theodosia
7                                    Thomas Jr
8               Edward Dale (Charlotte Lamson)
9                                        Ramon
10                                  John Jacob
11       John Jacob (Madeleine Talmadge Force)
12                            Leontine Pauline
13                              Ellen "Nellie"
14                       Algernon Henry Wilson
15                                      John D
16                                Quigg Edmond
17          James (Helene DeLaudeniere Chaput)
18                                      Albina
19                                     Thomson
20                             Richard Leonard
21           Richard Leonard (Sallie Monypeny)
22                                 Karl Howell
23                                     Rosalie
24                                       Ellen
25                                       Jakob
26                                 Dickinson H
27                  Dickinson H (Helen Walton)
28                                      Amelia
29                               Mauritz Hakan
                         ...
1279                     Hulda Amanda Adolfina
1280                                     Janko
1281                                   Achille
1282                                 Frederick
1283                           Charles William
1284                                     James
1285                                   Linhart
1286        George Joseph (Shawneene Abi-Saab)
1287                        Carl/Charles Peter
1288                              Jakob Alfred
1289                                Karl Johan
1290                       James (Ellen Needs)
1291                      Aaron ("Abi Weller")
1292                                    Edward
1293                       Howard Hugh "Harry"
1294                                    Leslie
1295                                     Einar
1296                                    Albert
1297                                 Phillippe
1298                                   Camille
1299                                    Antoni
1300                 Antoni (Selini Alexander)
1301                                   Gerious
1302                                     Wazli
1303                                   Gerious
1304                                    Hileni
1305                                   Thamine
1306                               Mapriededer
1307                                     Ortin
1308                                       Leo
Name: first_name, Length: 1309, dtype: object

In [6]:
titanic["first_name"].str.len()

0       17
1       14
2       14
3       24
4       34
5        6
6       19
7       10
8       31
9        6
10      11
11      38
12      17
13      15
14      22
15       7
16      13
17      35
18       7
19       8
20      16
21      34
22      12
23       8
24       6
25       6
26      12
27      27
28       7
29      14
        ..
1279    22
1280     6
1281     8
1282    10
1283    16
1284     6
1285     8
1286    35
1287    19
1288    13
1289    11
1290    20
1291    21
1292     7
1293    20
1294     7
1295     6
1296     7
1297    10
1298     8
1299     7
1300    26
1301     8
1302     6
1303     8
1304     7
1305     8
1306    12
1307     6
1308     4
Name: first_name, Length: 1309, dtype: int64

In [5]:
titanic["first_name"] = titanic["name"].str.split(",").str.get(1).str.split(".").str.get(1)

In [6]:
name = titanic["name"].str.split(", ").str.get(1).str.split(".").str.get(1).str.split(" ").str.get(2)
print(name)

0          Walton
1          Trevor
2         Loraine
3          Joshua
4               J
5             NaN
6       Theodosia
7              Jr
8            Dale
9             NaN
10          Jacob
11          Jacob
12        Pauline
13       "Nellie"
14          Henry
15              D
16         Edmond
17        (Helene
18            NaN
19            NaN
20        Leonard
21        Leonard
22         Howell
23            NaN
24            NaN
25            NaN
26              H
27              H
28            NaN
29          Hakan
          ...
1279       Amanda
1280          NaN
1281          NaN
1282          NaN
1283      William
1284          NaN
1285          NaN
1286       Joseph
1287        Peter
1288       Alfred
1289        Johan
1290       (Ellen
1291        ("Abi
1292          NaN
1293         Hugh
1294          NaN
1295          NaN
1296          NaN
1297          NaN
1298          NaN
1299          NaN
1300      (Selini
1301          NaN
1302          NaN
1303          NaN
1304          NaN
1305          NaN
1306          NaN
1307          NaN
1308          NaN
Name: name, Length: 1309, dtype: object

In [12]:

(len(titanic)) - (len(name.dropna(axis=0, how='all')))

464

In [9]:

titanic_survived=titanic[["boat","survived"]]
titanic_count=titanic_survived.groupby("boat").count()
print (titanic_count)

         survived
boat
2               1
1               5
10             29
11             25
12             19
13             39
13 15           2
13 15 B         1
14             33
15             37
15 16           1
16             23
2              12
3              26
4              31
5              27
5 7             2
5 9             1
6              20
7              23
8              23
8 10            1
9              25
A              11
B               9
C              38
C D             2
D              20

In [10]:
titanic_count["survived"].argmax()

'13'

In [11]:
titanic_count.survived.describe()

count    28.000000
mean     17.357143
std      13.024803
min       1.000000
25%       2.000000
50%      20.000000
75%      26.250000
max      39.000000
Name: survived, dtype: float64